"THANKS TO" = "Cảm ơn đến";
"DHowett, FOR Theos AND Logos." = "DHowett, vì các Theos và các Logos.";
"Saurik, FOR Cydia." = "Saurik, vì Cydia.";
"SPECIAL THANKS TO" = "Đặc biệt cảm ơn đến";
"BouchardAnthony, FOR ALL HIS SUGGESTIONS AND TESTING FOR ICAUGHTU PRO." = "BouchardAnthony, vì tất cả các đề xuất và thử nghiệm trên iCaughtU Pro.";
"Adam_Rotman, FOR ALL HIS TESTING." = "Adam_Rotman, vì tất cả các thử nghiệm.";
"iHaz3, FOR THE ICONS REALIZED FOR ICAUGHTU PRO." = "iHaz3, vì các biểu tượng nhận biết riêng cho iCaughtU Pro.";
"ALL MY BETA TESTERS." = "Tất cả các thử nghiệm viên Beta của tôi.";
"CREDITS" = "Các chứng nhận";